Tekla Open API Reference for Tekla Structures 2025
InputObjectDependencyAttribute Class
 The InputObjectDependencyAttribute class is used for storing an input object dependency which determines when the plug-in is updated in the system. The attribute is initialized from the custom attribute [InputObjectDependency(PluginBase.InputObjectDependency Type)] in the plug-in source.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.InputObjectDependencyAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class InputObjectDependencyAttribute : Attribute
Public NotInheritable Class InputObjectDependencyAttribute
	Inherits Attribute
The InputObjectDependencyAttribute type exposes the following members.
Constructors
Name | Description
InputObjectDependencyAttribute(Int32)
 The custom attribute [InputObjectDependency(PluginBase.InputObjectDependency Type)] uses this to store a dependency attribute which determines when the plug-in is updated in the system. This is not to be used by itself.
InputObjectDependencyAttribute(PluginBase.InputObjectDependency)
 The custom attribute [InputObjectDependency(PluginBase.InputObjectDependency Type)] uses this to store a dependency attribute which determines when the plug-in is updated in the system. This is not to be used by itself.
Top
Properties
Name | Description
Type
 Returns the type of the input object dependency.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace